; domain
(define (domain robot_chef)
    (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions)

    (:types
        location - object
        item - object
        robot - object
        ingredient tool dish - item
    )

    (:predicates
        (robot-at ?r - robot ?l - location)
        (item-at ?i - item ?l - location)
        (holding ?r - robot ?i - item)
        (hand-free ?r - robot)
        (adjacent ?l1 ?l2 - location)

        (is-storage ?l - location)
        (is-cooking ?l - location)
        (is-serving ?l - location)
        (is-preparation ?l - location)
        (is-dishwashing ?l - location)
        (is-cutting ?l - location)
        (is-mixing ?l - location)

        (ingredient-need-mixing ?i - ingredient)
        (ingredient-need-cutting ?i - ingredient)
        (ingredient-need-cooking ?i - ingredient)

        (ingredient-mixed ?i - ingredient)
        (ingredient-cut ?i - ingredient)
        (ingredient-cooked ?i - ingredient)

        (tool-clean ?t - tool)
        (is-cutting-tool ?t - tool)
        (is-mixing-tool ?t - tool)

        (ingredient-for ?i - ingredient ?d - dish)
        (dish-ready ?d - dish)
        (moving-to-serve ?r - robot)
        (dish-served ?d - dish)

        ; Ordering predicate
        (has-priority-over ?d1 ?d2 - dish)
    )

    (:action move
        :parameters (?r - robot ?from ?to - location)
        :precondition (and
            (robot-at ?r ?from)
            (adjacent ?from ?to)
            (or
                (not (moving-to-serve ?r)) ; Normal movement (no dish is ready to be serve)
                (is-serving ?to) ; Moving to serve
                (and ; On path to serving
                    (exists
                        (?next - location)
                        (and
                            (adjacent ?to ?next)
                            (is-serving ?next)
                        )
                    )
                )
            )
        )
        :effect (and
            (not (robot-at ?r ?from))
            (robot-at ?r ?to)
        )
    )

    (:action pick-up
        :parameters (?r - robot ?i - item ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (item-at ?i ?l)
            (hand-free ?r)
        )
        :effect (and
            (not (item-at ?i ?l))
            (not (hand-free ?r))
            (holding ?r ?i)
        )
    )

    (:action put-down
        :parameters (?r - robot ?i - item ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (holding ?r ?i)
        )
        :effect (and
            (item-at ?i ?l)
            (hand-free ?r)
            (not (holding ?r ?i))
        )
    )

    (:action cut-ingredient
        :parameters (?r - robot ?i - ingredient ?t - tool ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-cutting ?l)
            (holding ?r ?t)
            (is-cutting-tool ?t)
            (tool-clean ?t)
            (item-at ?i ?l)
            (ingredient-need-cutting ?i)
        )
        :effect (and
            (ingredient-cut ?i)
            (not (tool-clean ?t))
        )
    )

    (:action mix-ingredient
        :parameters (?r - robot ?i - ingredient ?t - tool ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-mixing ?l)
            (holding ?r ?t)
            (is-mixing-tool ?t)
            (tool-clean ?t)
            (item-at ?i ?l)
            (ingredient-need-mixing ?i)
        )
        :effect (and
            (ingredient-mixed ?i)
            (not (tool-clean ?t))
        )
    )

    (:action cook-ingredient
        :parameters (?r - robot ?i - ingredient ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-cooking ?l)
            (item-at ?i ?l)
            (ingredient-need-cooking ?i)
        )
        :effect (ingredient-cooked ?i)
    )

    (:action clean-tool
        :parameters (?r - robot ?t - tool ?l - location)
        :precondition (and
            (robot-at ?r ?l)
            (is-dishwashing ?l)
            (holding ?r ?t)
            (not (tool-clean ?t))
        )
        :effect (tool-clean ?t)
    )

    (:action prepare-dish
        :parameters (?r - robot ?d - dish ?prep - location)
        :precondition (and
            (robot-at ?r ?prep)
            (is-preparation ?prep)
            (not (moving-to-serve ?r)) ; Not already serving something
            ; Check that all higher priority dishes are already served
            (forall
                (?d2 - dish)
                (imply
                    (has-priority-over ?d2 ?d)
                    (dish-served ?d2)
                )
            )
            ; Check all ingredients are ready in prep area
            (forall
                (?i - ingredient)
                (imply
                    (ingredient-for ?i ?d)
                    (and
                        (item-at ?i ?prep)
                        (or (not (ingredient-need-cutting ?i)) (ingredient-cut ?i))
                        (or (not (ingredient-need-mixing ?i)) (ingredient-mixed ?i))
                        (or (not (ingredient-need-cooking ?i)) (ingredient-cooked ?i))
                    )
                )
            )
        )
        :effect (and
            (dish-ready ?d)
            (moving-to-serve ?r) ; Robot must now move to serving area
        )
    )

    (:action serve-dish
        :parameters (?r - robot ?d - dish ?serve - location)
        :precondition (and
            (robot-at ?r ?serve)
            (is-serving ?serve)
            (dish-ready ?d)
            (moving-to-serve ?r)
        )
        :effect (and
            (dish-served ?d)
            (not (dish-ready ?d))
            (not (moving-to-serve ?r)) ; Robot can now do other tasks
        )
    )

)

; problem
(define (problem multiple_dishes)
    (:domain robot_chef)

    (:objects
        storage-room cutting-room mixing-room cooking-room preparation-room serving-room dishwashing-room - location
        chef - robot
        knife spoon - tool
        rice fish vegetables noodles broth - ingredient
        sushi ramen - dish
    )

    (:init
        ; Robot initial location
        (robot-at chef cooking-room)
        (hand-free chef)

        ; Kitchen layout
        (is-storage storage-room)
        (is-cutting cutting-room)
        (is-mixing mixing-room)
        (is-cooking cooking-room)
        (is-preparation preparation-room)
        (is-serving serving-room)
        (is-dishwashing dishwashing-room)

        ; Initial ingredients location
        (item-at rice storage-room)
        (item-at fish storage-room)
        (item-at vegetables storage-room)
        (item-at noodles storage-room)
        (item-at broth storage-room)

        ; Tools setup
        (item-at knife cutting-room)
        (item-at spoon mixing-room)
        (tool-clean knife)
        (tool-clean spoon)
        (is-cutting-tool knife)
        (is-mixing-tool spoon)

        ; Ingredient requirements
        (ingredient-need-mixing rice)
        (ingredient-need-cooking rice)
        (ingredient-need-cutting fish)
        (ingredient-need-cutting vegetables)
        (ingredient-need-mixing noodles)
        (ingredient-need-cooking noodles)
        (ingredient-need-mixing broth)
        (ingredient-need-cooking broth)

        ; Recipe definitions
        (ingredient-for rice sushi)
        (ingredient-for fish sushi)
        (ingredient-for vegetables sushi)
        (ingredient-for noodles ramen)
        (ingredient-for broth ramen)
        (ingredient-for vegetables ramen)

        ; Room connections
        (adjacent serving-room cooking-room)
        (adjacent cooking-room serving-room)
        (adjacent cooking-room dishwashing-room)
        (adjacent dishwashing-room cooking-room)
        (adjacent preparation-room dishwashing-room)
        (adjacent dishwashing-room preparation-room)
        (adjacent preparation-room cooking-room)
        (adjacent cooking-room preparation-room)
        (adjacent mixing-room preparation-room)
        (adjacent preparation-room mixing-room)
        (adjacent mixing-room cutting-room)
        (adjacent cutting-room mixing-room)
        (adjacent storage-room mixing-room)
        (adjacent mixing-room storage-room)
        (adjacent cutting-room storage-room)
        (adjacent storage-room cutting-room)
    )

    (:goal
        (and
            (dish-served sushi)
            (dish-served ramen)
        )
    )
)

; plan
1. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
2. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
3. (move chef mixing-room cutting-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef cutting-room)
   goals met: 0 of 2
4. (pick-up chef knife cutting-room)
   deleted: (item-at knife cutting-room) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
5. (move chef cutting-room storage-room)
   deleted: (robot-at chef cutting-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
6. (put-down chef knife storage-room)
   deleted: (holding chef knife)
   added: (item-at knife storage-room) (hand-free chef)
   goals met: 0 of 2
7. (pick-up chef rice storage-room)
   deleted: (item-at rice storage-room) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
8. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
9. (put-down chef rice mixing-room)
   deleted: (holding chef rice)
   added: (item-at rice mixing-room) (hand-free chef)
   goals met: 0 of 2
10. (pick-up chef spoon mixing-room)
   deleted: (item-at spoon mixing-room) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
11. (mix-ingredient chef rice spoon mixing-room)
   deleted: (tool-clean spoon)
   added: (ingredient-mixed rice)
   goals met: 0 of 2
12. (put-down chef spoon mixing-room)
   deleted: (holding chef spoon)
   added: (item-at spoon mixing-room) (hand-free chef)
   goals met: 0 of 2
13. (pick-up chef rice mixing-room)
   deleted: (item-at rice mixing-room) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
14. (move chef mixing-room storage-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
15. (put-down chef rice storage-room)
   deleted: (holding chef rice)
   added: (item-at rice storage-room) (hand-free chef)
   goals met: 0 of 2
16. (pick-up chef noodles storage-room)
   deleted: (item-at noodles storage-room) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
17. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
18. (put-down chef noodles mixing-room)
   deleted: (holding chef noodles)
   added: (item-at noodles mixing-room) (hand-free chef)
   goals met: 0 of 2
19. (pick-up chef spoon mixing-room)
   deleted: (item-at spoon mixing-room) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
20. (move chef mixing-room storage-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
21. (put-down chef spoon storage-room)
   deleted: (holding chef spoon)
   added: (item-at spoon storage-room) (hand-free chef)
   goals met: 0 of 2
22. (pick-up chef broth storage-room)
   deleted: (item-at broth storage-room) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
23. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
24. (put-down chef broth mixing-room)
   deleted: (holding chef broth)
   added: (item-at broth mixing-room) (hand-free chef)
   goals met: 0 of 2
25. (move chef mixing-room storage-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
26. (pick-up chef vegetables storage-room)
   deleted: (item-at vegetables storage-room) (hand-free chef)
   added: (holding chef vegetables)
   goals met: 0 of 2
27. (move chef storage-room cutting-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef cutting-room)
   goals met: 0 of 2
28. (put-down chef vegetables cutting-room)
   deleted: (holding chef vegetables)
   added: (item-at vegetables cutting-room) (hand-free chef)
   goals met: 0 of 2
29. (move chef cutting-room storage-room)
   deleted: (robot-at chef cutting-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
30. (pick-up chef knife storage-room)
   deleted: (item-at knife storage-room) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
31. (move chef storage-room cutting-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef cutting-room)
   goals met: 0 of 2
32. (cut-ingredient chef vegetables knife cutting-room)
   deleted: (tool-clean knife)
   added: (ingredient-cut vegetables)
   goals met: 0 of 2
33. (move chef cutting-room storage-room)
   deleted: (robot-at chef cutting-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
34. (put-down chef knife storage-room)
   deleted: (holding chef knife)
   added: (item-at knife storage-room) (hand-free chef)
   goals met: 0 of 2
35. (pick-up chef fish storage-room)
   deleted: (item-at fish storage-room) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
36. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
37. (put-down chef fish mixing-room)
   deleted: (holding chef fish)
   added: (item-at fish mixing-room) (hand-free chef)
   goals met: 0 of 2
38. (pick-up chef broth mixing-room)
   deleted: (item-at broth mixing-room) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
39. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
40. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
41. (put-down chef broth cooking-room)
   deleted: (holding chef broth)
   added: (item-at broth cooking-room) (hand-free chef)
   goals met: 0 of 2
42. (cook-ingredient chef broth cooking-room)
   added: (ingredient-cooked broth)
   goals met: 0 of 2
43. (pick-up chef broth cooking-room)
   deleted: (item-at broth cooking-room) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
44. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
45. (put-down chef broth preparation-room)
   deleted: (holding chef broth)
   added: (item-at broth preparation-room) (hand-free chef)
   goals met: 0 of 2
46. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
47. (pick-up chef fish mixing-room)
   deleted: (item-at fish mixing-room) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
48. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
49. (put-down chef fish preparation-room)
   deleted: (holding chef fish)
   added: (item-at fish preparation-room) (hand-free chef)
   goals met: 0 of 2
50. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
51. (move chef mixing-room cutting-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef cutting-room)
   goals met: 0 of 2
52. (pick-up chef vegetables cutting-room)
   deleted: (item-at vegetables cutting-room) (hand-free chef)
   added: (holding chef vegetables)
   goals met: 0 of 2
53. (move chef cutting-room mixing-room)
   deleted: (robot-at chef cutting-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
54. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
55. (put-down chef vegetables preparation-room)
   deleted: (holding chef vegetables)
   added: (item-at vegetables preparation-room) (hand-free chef)
   goals met: 0 of 2
56. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
57. (move chef mixing-room storage-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
58. (pick-up chef rice storage-room)
   deleted: (item-at rice storage-room) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
59. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
60. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
61. (put-down chef rice preparation-room)
   deleted: (holding chef rice)
   added: (item-at rice preparation-room) (hand-free chef)
   goals met: 0 of 2
62. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
63. (move chef mixing-room storage-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
64. (pick-up chef knife storage-room)
   deleted: (item-at knife storage-room) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
65. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
66. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
67. (move chef preparation-room dishwashing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef dishwashing-room)
   goals met: 0 of 2
68. (clean-tool chef knife dishwashing-room)
   added: (tool-clean knife)
   goals met: 0 of 2
69. (move chef dishwashing-room preparation-room)
   deleted: (robot-at chef dishwashing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
70. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
71. (put-down chef knife mixing-room)
   deleted: (holding chef knife)
   added: (item-at knife mixing-room) (hand-free chef)
   goals met: 0 of 2
72. (move chef mixing-room storage-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 2
73. (pick-up chef spoon storage-room)
   deleted: (item-at spoon storage-room) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
74. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
75. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
76. (move chef preparation-room dishwashing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef dishwashing-room)
   goals met: 0 of 2
77. (clean-tool chef spoon dishwashing-room)
   added: (tool-clean spoon)
   goals met: 0 of 2
78. (move chef dishwashing-room preparation-room)
   deleted: (robot-at chef dishwashing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
79. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
80. (mix-ingredient chef noodles spoon mixing-room)
   deleted: (tool-clean spoon)
   added: (ingredient-mixed noodles)
   goals met: 0 of 2
81. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
82. (put-down chef spoon preparation-room)
   deleted: (holding chef spoon)
   added: (item-at spoon preparation-room) (hand-free chef)
   goals met: 0 of 2
83. (pick-up chef fish preparation-room)
   deleted: (item-at fish preparation-room) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
84. (move chef preparation-room dishwashing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef dishwashing-room)
   goals met: 0 of 2
85. (put-down chef fish dishwashing-room)
   deleted: (holding chef fish)
   added: (item-at fish dishwashing-room) (hand-free chef)
   goals met: 0 of 2
86. (move chef dishwashing-room preparation-room)
   deleted: (robot-at chef dishwashing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
87. (pick-up chef rice preparation-room)
   deleted: (item-at rice preparation-room) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
88. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
89. (put-down chef rice cooking-room)
   deleted: (holding chef rice)
   added: (item-at rice cooking-room) (hand-free chef)
   goals met: 0 of 2
90. (cook-ingredient chef rice cooking-room)
   added: (ingredient-cooked rice)
   goals met: 0 of 2
91. (pick-up chef rice cooking-room)
   deleted: (item-at rice cooking-room) (hand-free chef)
   added: (holding chef rice)
   goals met: 0 of 2
92. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
93. (put-down chef rice preparation-room)
   deleted: (holding chef rice)
   added: (item-at rice preparation-room) (hand-free chef)
   goals met: 0 of 2
94. (move chef preparation-room dishwashing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef dishwashing-room)
   goals met: 0 of 2
95. (pick-up chef fish dishwashing-room)
   deleted: (item-at fish dishwashing-room) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
96. (move chef dishwashing-room preparation-room)
   deleted: (robot-at chef dishwashing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
97. (put-down chef fish preparation-room)
   deleted: (holding chef fish)
   added: (item-at fish preparation-room) (hand-free chef)
   goals met: 0 of 2
98. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
99. (pick-up chef noodles mixing-room)
   deleted: (item-at noodles mixing-room) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
100. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
101. (put-down chef noodles preparation-room)
   deleted: (holding chef noodles)
   added: (item-at noodles preparation-room) (hand-free chef)
   goals met: 0 of 2
102. (pick-up chef spoon preparation-room)
   deleted: (item-at spoon preparation-room) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
103. (move chef preparation-room dishwashing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef dishwashing-room)
   goals met: 0 of 2
104. (clean-tool chef spoon dishwashing-room)
   added: (tool-clean spoon)
   goals met: 0 of 2
105. (move chef dishwashing-room preparation-room)
   deleted: (robot-at chef dishwashing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
106. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
107. (put-down chef spoon mixing-room)
   deleted: (holding chef spoon)
   added: (item-at spoon mixing-room) (hand-free chef)
   goals met: 0 of 2
108. (pick-up chef knife mixing-room)
   deleted: (item-at knife mixing-room) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
109. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
110. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
111. (move chef cooking-room serving-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef serving-room)
   goals met: 0 of 2
112. (put-down chef knife serving-room)
   deleted: (holding chef knife)
   added: (item-at knife serving-room) (hand-free chef)
   goals met: 0 of 2
113. (move chef serving-room cooking-room)
   deleted: (robot-at chef serving-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
114. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
115. (pick-up chef broth preparation-room)
   deleted: (item-at broth preparation-room) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
116. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
117. (put-down chef broth mixing-room)
   deleted: (holding chef broth)
   added: (item-at broth mixing-room) (hand-free chef)
   goals met: 0 of 2
118. (pick-up chef spoon mixing-room)
   deleted: (item-at spoon mixing-room) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
119. (mix-ingredient chef broth spoon mixing-room)
   deleted: (tool-clean spoon)
   added: (ingredient-mixed broth)
   goals met: 0 of 2
120. (put-down chef spoon mixing-room)
   deleted: (holding chef spoon)
   added: (item-at spoon mixing-room) (hand-free chef)
   goals met: 0 of 2
121. (pick-up chef broth mixing-room)
   deleted: (item-at broth mixing-room) (hand-free chef)
   added: (holding chef broth)
   goals met: 0 of 2
122. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
123. (put-down chef broth preparation-room)
   deleted: (holding chef broth)
   added: (item-at broth preparation-room) (hand-free chef)
   goals met: 0 of 2
124. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
125. (move chef cooking-room serving-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef serving-room)
   goals met: 0 of 2
126. (pick-up chef knife serving-room)
   deleted: (item-at knife serving-room) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
127. (move chef serving-room cooking-room)
   deleted: (robot-at chef serving-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
128. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
129. (put-down chef knife preparation-room)
   deleted: (holding chef knife)
   added: (item-at knife preparation-room) (hand-free chef)
   goals met: 0 of 2
130. (pick-up chef noodles preparation-room)
   deleted: (item-at noodles preparation-room) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
131. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
132. (put-down chef noodles cooking-room)
   deleted: (holding chef noodles)
   added: (item-at noodles cooking-room) (hand-free chef)
   goals met: 0 of 2
133. (cook-ingredient chef noodles cooking-room)
   added: (ingredient-cooked noodles)
   goals met: 0 of 2
134. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
135. (pick-up chef fish preparation-room)
   deleted: (item-at fish preparation-room) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
136. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
137. (move chef mixing-room cutting-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef cutting-room)
   goals met: 0 of 2
138. (put-down chef fish cutting-room)
   deleted: (holding chef fish)
   added: (item-at fish cutting-room) (hand-free chef)
   goals met: 0 of 2
139. (move chef cutting-room mixing-room)
   deleted: (robot-at chef cutting-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
140. (pick-up chef spoon mixing-room)
   deleted: (item-at spoon mixing-room) (hand-free chef)
   added: (holding chef spoon)
   goals met: 0 of 2
141. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
142. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
143. (move chef cooking-room serving-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef serving-room)
   goals met: 0 of 2
144. (put-down chef spoon serving-room)
   deleted: (holding chef spoon)
   added: (item-at spoon serving-room) (hand-free chef)
   goals met: 0 of 2
145. (move chef serving-room cooking-room)
   deleted: (robot-at chef serving-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
146. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
147. (pick-up chef knife preparation-room)
   deleted: (item-at knife preparation-room) (hand-free chef)
   added: (holding chef knife)
   goals met: 0 of 2
148. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
149. (move chef mixing-room cutting-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef cutting-room)
   goals met: 0 of 2
150. (cut-ingredient chef fish knife cutting-room)
   deleted: (tool-clean knife)
   added: (ingredient-cut fish)
   goals met: 0 of 2
151. (put-down chef knife cutting-room)
   deleted: (holding chef knife)
   added: (item-at knife cutting-room) (hand-free chef)
   goals met: 0 of 2
152. (pick-up chef fish cutting-room)
   deleted: (item-at fish cutting-room) (hand-free chef)
   added: (holding chef fish)
   goals met: 0 of 2
153. (move chef cutting-room mixing-room)
   deleted: (robot-at chef cutting-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 2
154. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 2
155. (put-down chef fish preparation-room)
   deleted: (holding chef fish)
   added: (item-at fish preparation-room) (hand-free chef)
   goals met: 0 of 2
156. (prepare-dish chef sushi preparation-room)
   added: (dish-ready sushi) (moving-to-serve chef)
   goals met: 0 of 2
157. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 2
158. (pick-up chef noodles cooking-room)
   deleted: (item-at noodles cooking-room) (hand-free chef)
   added: (holding chef noodles)
   goals met: 0 of 2
159. (move chef cooking-room serving-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef serving-room)
   goals met: 0 of 2
160. (serve-dish chef sushi serving-room)
   deleted: (dish-ready sushi) (moving-to-serve chef)
   added: (dish-served sushi)
   goals met: 1 of 2
161. (move chef serving-room cooking-room)
   deleted: (robot-at chef serving-room)
   added: (robot-at chef cooking-room)
   goals met: 1 of 2
162. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 1 of 2
163. (put-down chef noodles preparation-room)
   deleted: (holding chef noodles)
   added: (item-at noodles preparation-room) (hand-free chef)
   goals met: 1 of 2
164. (prepare-dish chef ramen preparation-room)
   added: (dish-ready ramen) (moving-to-serve chef)
   goals met: 1 of 2
165. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 1 of 2
166. (move chef cooking-room serving-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef serving-room)
   goals met: 1 of 2
167. (serve-dish chef ramen serving-room)
   deleted: (dish-ready ramen) (moving-to-serve chef)
   added: (dish-served ramen)
   goals met: 2 of 2
